MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_pid.h
/**
 *******************************************************************************
 * @file hc32_ll_pid.h
 * @brief This file contains all the functions prototypes of the PID driver
 *        library.
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_PID_H__
#define __HC32_LL_PID_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f5xx.h"
#include "hc32f5xx_conf.h"
    /**
     * @addtogroup LL_Driver
     * @{
     */

    /**
     * @addtogroup LL_PID
     * @{
     */

#if (LL_PID_ENABLE == DDL_ON)

    /*******************************************************************************
     * Global type definitions ('typedef')
     ******************************************************************************/
    /**
     * @defgroup PID_Global_Types PID Global Types
     * @{
     */

    /**
     * @brief PID initial structure definition
     */
    typedef struct
    {
        uint32_t u32PidEn;        /*!< Specifies the PID function.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32CalMode;      /*!< Specifies the PID calculate mode.
                                            This parameter can be a value of @ref PID_Cal_Mode            */
        uint32_t u32IMode;        /*!< Specifies the PID integrate mode.
                                            This parameter can be a value of @ref PID_Integ_Mode          */
        uint32_t u32DMode;        /*!< Specifies the PID differential mode.
                                            This parameter can be a value of @ref PID_Diff_Mode           */
        uint32_t u32CoefMode;     /*!< Specifies the PID coefficient mode.
                                            This parameter can be a value of @ref PID_Coef_Mode           */
        uint32_t u32AntiWindupEn; /*!< Specifies wether use anti windup or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U1P1En;       /*!< Specifies wether use U1_P1 to calculate U1 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U1P2En;       /*!< Specifies wether use U1_P2 to calculate U1 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U1P2Sel;      /*!< Specifies the PID U1_P2 data selection.
                                            This parameter can be a value of @ref PID_U1_P2_Data_Sel     */
        uint32_t u32U3P1En;       /*!< Specifies wether use U3_P1 to calculate U3 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U3P2En;       /*!< Specifies wether use U3_P2 to calculate U3 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U3P2Wait;     /*!< Specifies wether wait the U3_P2 data ready or not while calculate U3.
                                            This parameter can be a value of @ref PID_U3_P2_Wait_State   */
        uint32_t u32U3P2Sel;      /*!< Specifies the PID U3_P2 data selection.
                                            This parameter can be a value of @ref PID_U3_P2_Data_Sel     */
        uint32_t u32U3P3En;       /*!< Specifies wether use U3_P3 to calculate U3 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U3P4En;       /*!< Specifies wether use U3_P4 to calculate U3 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U3P4Wait;     /*!< Specifies wether wait the U3_P4 data ready or not while calculate U3.
                                            This parameter can be a value of @ref PID_U3_P4_Wait_State   */
        uint32_t u32U3P4Type;     /*!< Specifies the PID U3_P4 calculate type.
                                            This parameter can be a value of @ref PID_U3_P4_Cal_Type     */
        uint32_t u32U4P1En;       /*!< Specifies wether use U4_P1 to calculate U4 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U5P1En;       /*!< Specifies wether use U5_P1 to calculate U5 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32U5P2En;       /*!< Specifies wether use U5_P2 to calculate U5 or not.
                                            This parameter can be a value of @ref en_functional_state_t   */
    } stc_pid_init_t;

    /**
     * @brief PID software start initial structure definition
     */
    typedef struct
    {
        uint32_t u32State;     /*!< Specifies the state of software start
                                            This parameter can be a value of @ref en_functional_state_t   */
        uint32_t u32InitEvSel; /*!< Specifies the initial expected value source
                                            This parameter can be a value of @ref PID_SW_Init_Ev_Sel      */
        float32_t f32FinalEv;  /*!< Specifies the finally expected value */
        float32_t f32Step;     /*!< Specifies the step value of expected value while calculate */
    } stc_pid_sw_init_t;

    /**
     * @brief PID gain configure structure definition
     */
    typedef struct
    {
        float32_t f32Kp;  /*!< Proportional gain */
        float32_t f32Ki;  /*!< Integral gain */
        float32_t f32Kd;  /*!< Derivative gain */
        float32_t f32Kdf; /*!< Derivative feedback gain */
    } stc_pid_gain_config_t;

    /**
     * @brief PID gain structure definition
     */
    typedef struct
    {
        float32_t f32Kf;  /*!< Absolute err coefficient */
        float32_t f32Kp;  /*!< Proportional gain */
        float32_t f32Ki;  /*!< Integral gain */
        float32_t f32Kd;  /*!< Derivative gain */
        float32_t f32Kdf; /*!< Derivative feedback gain */
    } stc_pid_gain_t;

    /**
     * @brief PID gain switch structure definition
     */
    typedef struct
    {
        float32_t f32threshold1; /*!< Gain switch threshold1 */
        float32_t f32threshold2; /*!< Gain switch threshold2 */
        float32_t f32Delay1;     /*!< Gain switch delay1 */
        float32_t f32Delay2;     /*!< Gain switch delay2 */
    } stc_pid_gain_switch_t;

    /**
     * @brief PID configure structure definition
     */
    typedef struct
    {
        uint32_t u32AValSel;  /*!< Specifies the PID actual value selection.
                                            This parameter can be a value of @ref PID_AVAL_Sel     */
        uint32_t u32EValSel;  /*!< Specifies the PID expected value selection.
                                            This parameter can be a value of @ref PID_EV_Sel     */
        uint32_t u32EkMinSel; /*!< Specifies the PID E(k) minimum selection.
                                            This parameter can be a value of @ref PID_Ek_Min_Sel   */
        uint32_t u32KfMinSel; /*!< Specifies the PID E(k) minimum selection.
                                            This parameter can be a value of @ref PID_Kf_Min_Sel   */
        uint32_t u32KiMinSel; /*!< Specifies the PID Ki minimum selection.
                                            This parameter can be a value of @ref PID_Ki_Min_Sel   */
        uint32_t u32KdMinSel; /*!< Specifies the PID Kd minimum selection.
                                            This parameter can be a value of @ref PID_Kd_Min_Sel   */
        uint32_t u32UMinSel;  /*!< Specifies the PID U minimum selection.
                                            This parameter can be a value of @ref PID_U_Min_Sel    */
        uint32_t u32U1MinSel; /*!< Specifies the PID U1 minimum selection.
                                            This parameter can be a value of @ref PID_U1_Min_Sel   */
        uint32_t u32U3MinSel; /*!< Specifies the PID U3 minimum selection.
                                            This parameter can be a value of @ref PID_U3_Min_Sel   */
        uint32_t u32U5MinSel; /*!< Specifies the PID U5 minimum selection.
                                            This parameter can be a value of @ref PID_U5_Min_Sel   */
    } stc_pid_config_t;

    /**
     * @brief PID value configure structure definition
     */
    typedef struct
    {
        float32_t f32EkMax; /*!< Specifies the PID E(k) maximum */
        float32_t f32EkMin; /*!< Specifies the PID E(k) minimum */
        float32_t f32KiMax; /*!< Specifies the PID Ki maximum */
        float32_t f32KiMin; /*!< Specifies the PID Ki minimum */
        float32_t f32KdMax; /*!< Specifies the PID Kd maximum */
        float32_t f32KdMin; /*!< Specifies the PID Kd minimum */
        float32_t f32UMax;  /*!< Specifies the PID U maximum */
        float32_t f32UMin;  /*!< Specifies the PID U minimum */
        float32_t f32U1Max; /*!< Specifies the PID U1 maximum */
        float32_t f32U1Min; /*!< Specifies the PID U1 minimum */
        float32_t f32U3Max; /*!< Specifies the PID U3 maximum */
        float32_t f32U3Min; /*!< Specifies the PID U3 minimum */
        float32_t f32U5Max; /*!< Specifies the PID U5 maximum */
        float32_t f32U5Min; /*!< Specifies the PID U5 minimum */
    } stc_pid_value_config_t;

    /**
     * @brief PID UxPx value structure definition
     */
    typedef struct
    {
        float32_t f32U1P1; /*!< Specifies the PID U1P1 value */
        float32_t f32U1P2; /*!< Specifies the PID U1P2 value, read only, valid while U1P2_EN = 1 */
        float32_t f32U3P1; /*!< Specifies the PID U3P1 value */
        float32_t f32U3P2; /*!< Specifies the PID U3P2 value, read only, valid while U3P2_EN = 1 */
        float32_t f32U3P3; /*!< Specifies the PID U3P3 value */
        float32_t f32U3P4; /*!< Specifies the PID U3P4 value  read only, valid while U3P4_EN = 1 */
        float32_t f32U4P1; /*!< Specifies the PID U4P1 value */
        float32_t f32U5P1; /*!< Specifies the PID U5P1 value */
        float32_t f32U5P2; /*!< Specifies the PID U5P2 value */
    } stc_pid_uxpx_t;

    /**
     * @brief PID value structure definition
     */
    typedef struct
    {
        float32_t f32Ek;   /*!< Current E(k) */
        float32_t f32PVal; /*!< The value after proportion */
        float32_t f32IVal; /*!< The value after integration */
        float32_t f32DVal; /*!< The value after derivative */
        float32_t f32U;    /*!< Control value U */
        float32_t f32U1;   /*!< Control value U1 */
        float32_t f32U2;   /*!< Control value U2 */
        float32_t f32U3;   /*!< Control value U3 */
        float32_t f32U4;   /*!< Control value U4 */
        float32_t f32U5;   /*!< Control value U5 */
        uint32_t u32Uf;    /*!< Control value U fixed-point number */
        uint32_t u32U5f;   /*!< Control value U5 fixed-point number */
    } stc_pid_value_t;

    /**
     * @brief PID compare initial structure definition
     */
    typedef struct
    {
        uint32_t u32CompEn;        /*!< Specifies the PID competition state.
                                            This parameter can be a value of @ref en_functional_state_t     */
        uint32_t u32CompIntEn;     /*!< Specifies the PID competition complete interrupt state.
                                            This parameter can be a value of @ref en_functional_state_t     */
        uint32_t u32CompOutputSel; /*!< Specifies the PID competition output selection.
                                            This parameter can be a value of @ref PID_Comp_Output_Sel       */
        uint32_t u32BurstIntEn;    /*!< Specifies the PID burst complete interrupt state.
                                            This parameter can be a value of @ref en_functional_state_t     */
        uint32_t u32BurstFuncSel;  /*!< Specifies the PID burst function selection.
                                            This parameter can be a value of @ref PID_Burst_Function_Sel    */
        uint32_t u32BurstMode;     /*!< Specifies the PID burst mode.
                                            This parameter can be a value of @ref PID_Burst_Mode_Sel        */
        uint32_t u32BurstIntSel;   /*!< Specifies the PID burst interrupt selection.
                                            This parameter can be a value of @ref PID_Burst_Int_Sel         */
    } stc_pid_cmp_init_t;

/**
 * @}
 */

