MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_pid.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/

/**
 * @defgroup PID_Global_Macros PID Global Macros
 * @{
 */

/**
 * @defgroup PID_U1_P2_Data_Sel PID U1 P2 data selection
 * @{
 */
#define PID_U1_P2_DATA_IIR1 (0UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR1 */
#define PID_U1_P2_DATA_IIR2 (1UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR2 */
#define PID_U1_P2_DATA_IIR3 (2UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR3 */
#define PID_U1_P2_DATA_IIR4 (3UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR4 */
#define PID_U1_P2_DATA_IIR5 (5UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR5 */
#define PID_U1_P2_DATA_IIR6 (6UL << PID_CR_U1P2_SEL_POS) /*!< U1_P2 select IIR6 */
/**
 * @}
 */

/**
 * @defgroup PID_U3_P2_Data_Sel PID U3 P2 data selection
 * @{
 */
#define PID_U3_P2_DATA_SOGI_SIN    (0UL << PID_CR_U3P2_SEL_POS) /*!< U3_P2 select SOGI sine */
#define PID_U3_P2_DATA_SOGI_COS    (1UL << PID_CR_U3P2_SEL_POS) /*!< U3_P2 select SOGI cosine */
#define PID_U3_P2_DATA_CORDIC_RES1 (2UL << PID_CR_U3P2_SEL_POS) /*!< U3_P2 select CORDIC result 1 */
#define PID_U3_P2_DATA_CORDIC_RES2 (3UL << PID_CR_U3P2_SEL_POS) /*!< U3_P2 select CORDIC result 2 */
/**
 * @}
 */

/**
 * @defgroup PID_U3_P2_Wait_State PID wait or not wait wait  U3_P2
 * @{
 */
#define PID_U3_P2_WAIT_OFF (0UL << PID_CR_U3P4_WAIT_POS) /*!< Use U3_P2 to calculate U3, not wait the external data */
#define PID_U3_P2_WAIT_ON  (1UL << PID_CR_U3P4_WAIT_POS) /*!< Wait the external data, then calculate U3 */
/**
 * @}
 */

/**
 * @defgroup PID_U3_P4_Cal_Type PID U3 P4 calculate type
 * @{
 */
#define PID_U3_P4_CAL_ADD (0UL << PID_CR_U3P4_TYPE_POS) /*!< Add U3_P4 */
#define PID_U3_P4_CAL_SUB (1UL << PID_CR_U3P4_TYPE_POS) /*!< Sub U3_P4 */
/**
 * @}
 */

/**
 * @defgroup PID_U3_P4_Wait_State PID wait or not wait wait  U3_P4
 * @{
 */
#define PID_U3_P4_WAIT_OFF (0UL << PID_CR_U3P4_WAIT_POS) /*!< Use U3_P4 to calculate U3, not wait the external data */
#define PID_U3_P4_WAIT_ON  (1UL << PID_CR_U3P4_WAIT_POS) /*!< Wait the external data, then calculate U3 */
/**
 * @}
 */

/**
 * @defgroup PID_Coef_Mode PID coefficient mode
 * @{
 */
#define PID_COEF_MD_1 (0UL << PID_CR_COEF_MODE_POS) /*!< Use 1 coefficient only */
#define PID_COEF_MD_2 (1UL << PID_CR_COEF_MODE_POS) /*!< Use E(k) and threshold via 3 coefficients */
#define PID_COEF_MD_3 (2UL << PID_CR_COEF_MODE_POS) /*!< Use expected value and threshold via 3 coefficients */
#define PID_COEF_MD_4 (3UL << PID_CR_COEF_MODE_POS) /*!< Use fixed coefficient & E(k) */
/**
 * @}
 */

/**
 * @defgroup PID_Integ_Mode  PID integrate mode
 * @{
 */
#define PID_INTEG_MD_EK      (0UL << PID_CR_IMODE_POS) /*!< PID integrate use E(k) */
#define PID_INTEG_MD_EK_EK_1 (1UL << PID_CR_IMODE_POS) /*!< PID integrate use E(k) and E(k-1) */
/**
 * @}
 */

/**
 * @defgroup PID_Diff_Mode  PID differential mode
 * @{
 */
#define PID_DIFF_MD_WITHOUT_FEEDBACK (0UL << PID_CR_DMODE_POS) /*!< PID without differential feedback */
#define PID_DIFF_MD_WITH_FEEDBACK    (1UL << PID_CR_DMODE_POS) /*!< PID with differential feedback */
/**
 * @}
 */

/**
 * @defgroup PID_Cal_Mode PID calculate mode
 * @{
 */
#define PID_CAL_MD_SW          (0UL << PID_CR_CAL_MODE_POS) /*!< PID calculate after software start */
#define PID_CAL_MD_HW_AVAL     (1UL << PID_CR_CAL_MODE_POS) /*!< PID calculate after write PID AVAL */
#define PID_CAL_MD_HW_AVAL_REF (2UL << PID_CR_CAL_MODE_POS) /*!< PID calculate after write PID AVAL & REF */
/**
 * @}
 */

/**
 * @defgroup PID_AVAL_Sel PID actual value selection
 * @{
 */
#define PID_AVAL_REG  (0UL << PID_CR2_ASEL_POS) /*!< PID actual value is PID_AVAL register value */
#define PID_AVAL_IIR1 (1UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR1 */
#define PID_AVAL_IIR2 (2UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR2 */
#define PID_AVAL_IIR3 (3UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR3 */
#define PID_AVAL_IIR4 (4UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR4 */
#define PID_AVAL_IIR5 (5UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR5 */
#define PID_AVAL_IIR6 (6UL << PID_CR2_ASEL_POS) /*!< PID actual value is IIR6 */
/**
 * @}
 */

/**
 * @defgroup PID_EV_Sel PID expected value selection
 * @{
 */
#define PID_EV_REG   (0UL << PID_CR2_DSEL_POS) /*!< PID expected value is PID_REF register value */
#define PID_EV_P1_U3 (1UL << PID_CR2_DSEL_POS) /*!< PID expected value is P1_U3 */
#define PID_EV_P2_U3 (2UL << PID_CR2_DSEL_POS) /*!< PID expected value is P2_U3 */
#define PID_EV_IIR1  (3UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR1 */
#define PID_EV_IIR2  (4UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR2 */
#define PID_EV_IIR3  (5UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR3 */
#define PID_EV_IIR4  (6UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR4 */
#define PID_EV_IIR5  (7UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR5 */
#define PID_EV_IIR6  (8UL << PID_CR2_ASEL_POS) /*!< PID expected value is IIR6 */
/**
 * @}
 */

/**
 * @defgroup PID_Ek_Min_Sel PID KF minimum selection
 * @{
 */
#define PID_EK_MIN_EMIN (0UL << PID_CR2_EMIN_SEL_POS) /*!< If E(k) < PID_EMIN, E(k) = PID_EMIN */
#define PID_EK_MIN_0    (1UL << PID_CR2_EMIN_SEL_POS) /*!< If E(k) < PID_EMIN, E(k) = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_Kf_Min_Sel PID Kf minimum selection
 * @{
 */
#define PID_KF_MIN_KFMIN (0UL << PID_CR2_KFMIN_SEL_POS) /*!< If KF < PID_KFMIN, KF = PID_KFMIN */
#define PID_KF_MIN_0     (1UL << PID_CR2_KFMIN_SEL_POS) /*!< If KF < PID_KFMIN, KF = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_Ki_Min_Sel PID Ki minimum selection
 * @{
 */
#define PID_KI_MIN_IMIN (0UL << PID_CR2_IMIN_SEL_POS) /*!< If Ki < PID_IMIN, Ki = PID_IMIN */
#define PID_KI_MIN_0    (1UL << PID_CR2_IMIN_SEL_POS) /*!< If Ki < PID_IMIN, Ki = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_Kd_Min_Sel PID Kd minimum selection
 * @{
 */
#define PID_KD_MIN_DMIN (0UL << PID_CR2_DMIN_SEL_POS) /*!< If Kd < PID_DMIN, Kd = PID_DMIN */
#define PID_KD_MIN_0    (1UL << PID_CR2_DMIN_SEL_POS) /*!< If Kd < PID_DMIN, Kd = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_U_Min_Sel PID U minimum selection
 * @{
 */
#define PID_U_MIN_UMIN (0UL << PID_CR2_UMIN_SEL_POS) /*!< If U < PID_UMIN, U = PID_UMIN */
#define PID_U_MIN_0    (1UL << PID_CR2_UMIN_SEL_POS) /*!< If U < PID_UMIN, U = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_U1_Min_Sel PID U1 minimum selection
 * @{
 */
#define PID_U1_MIN_U1MIN (0UL << PID_CR2_U1MIN_SEL_POS) /*!< If U1 < PID_U1MIN, U1 = PID_U1MIN */
#define PID_U1_MIN_0     (1UL << PID_CR2_U1MIN_SEL_POS) /*!< If U1 < PID_U1MIN, U1 = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_U3_Min_Sel PID U3 minimum selection
 * @{
 */
#define PID_U3_MIN_U3MIN (0UL << PID_CR2_U3MIN_SEL_POS) /*!< If U3 < PID_U3MIN, U3 = PID_U3MIN */
#define PID_U3_MIN_0     (1UL << PID_CR2_U3MIN_SEL_POS) /*!< If U3 < PID_U3MIN, U3 = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_U5_Min_Sel PID U5 minimum selection
 * @{
 */
#define PID_U5_MIN_U5MIN (0UL << PID_CR2_U5MIN_SEL_POS) /*!< If U5 < PID_U5MIN, U5 = PID_U5MIN */
#define PID_U5_MIN_0     (1UL << PID_CR2_U5MIN_SEL_POS) /*!< If U5 < PID_U5MIN, U5 = 0 */
/**
 * @}
 */

/**
 * @defgroup PID_SW_Init_Ev_Sel PID software initial value selection
 * @{
 */
#define PID_SW_INIT_EV_REF  (0UL << PID_CR2_REF_INIT_POS) /*!< While software start, the expected value is the written value of register PID_REF */
#define PID_SW_INIT_EV_AVAL (1UL << PID_CR2_REF_INIT_POS) /*!< While software start, the expected value is the PID_AVAL */
/**
 * @}
 */

/**
 * @defgroup PID_Flag_Sel PID flag selection
 * @{
 */
#define PID_FLAG_DATA_RDY (1UL << PID_STA_DATA_RDY_POS) /*!< Data ready to be read */
#define PID_FLAG_CAL_OVER (1UL << PID_STA_CAL_OOR_POS)  /*!< Calculate over run */
#define PID_FLAG_CAL_INF  (1UL << PID_STA_CAL_INF_POS)  /*!< There is infinite value while calculate */
#define PID_FLAG_CAL_NAN  (1UL << PID_STA_CAL_NAN_POS)  /*!< There is invalid value while calculate */
/**
 * @}
 */

/**
 * @defgroup PID_Coef_Num_Sel PID coefficient num selection
 * @{
 */
#define PID_COEF_NUM_1 (0U) /*!< First coefficient */
#define PID_COEF_NUM_2 (1U) /*!< Second coefficient */
#define PID_COEF_NUM_3 (2U) /*!< Third coefficient */
/**
 * @}
 */

/**
 * @defgroup PID_Comp_Output_Sel PID competitive output selection
 * @{
 */
#define PID_COMP_OUTPUT_PID1 (0UL << PID_CMP_CR_CMP_SEL_POS) /*!< Competitive output PID1 data */
#define PID_COMP_OUTPUT_PID2 (1UL << PID_CMP_CR_CMP_SEL_POS) /*!< Competitive output PID2 data */
#define PID_COMP_OUTPUT_MAX  (2UL << PID_CMP_CR_CMP_SEL_POS) /*!< Competitive output the max data between PID1 and PID2 */
#define PID_COMP_OUTPUT_MIN  (3UL << PID_CMP_CR_CMP_SEL_POS) /*!< Competitive output the min data between PID1 and PID2 */
/**
 * @}
 */

/**
 * @defgroup PID_Burst_Function_Sel PID burst function selection
 * @{
 */
#define PID_BURST_FUNC_NONE        (0UL << PID_CMP_CR_BSEL_POS) /*!< Burst function valid */
#define PID_BURST_FUNC_PID1        (1UL << PID_CMP_CR_BSEL_POS) /*!< Burst function select PID1 */
#define PID_BURST_FUNC_PID2        (2UL << PID_CMP_CR_BSEL_POS) /*!< Burst function select PID2 */
#define PID_BURST_FUNC_COMP_OUTPUT (3UL << PID_CMP_CR_BSEL_POS) /*!< Burst function select competitive output */
/**
 * @}
 */

/**
 * @defgroup PID_Burst_Int_Sel PID burst interrupt selection
 * @{
 */
#define PID_BURST_INT_DONE_THRESHOLD (0UL << PID_CMP_CR_BURST_INT_SEL_POS) /*!< Burst compare done & data < threshold */
#define PID_BURST_INT_DONE           (1UL << PID_CMP_CR_BURST_INT_SEL_POS) /*!< Burst compare done */
/**
 * @}
 */

/**
 * @defgroup PID_Burst_Mode_Sel PID burst mode selection
 * @{
 */
#define PID_BURST_MD_1 (0UL << PID_CMP_CR_BMODE_POS) /*!< Mode 1, if PCMP < threshold, BMCMP = HRPWM period + 1;     \
                                                                                             if PCMP >= threshold, BMCMP = 0                      */
#define PID_BURST_MD_2 (1UL << PID_CMP_CR_BMODE_POS) /*!< Mode 2, if PCMP < threshold, BMCMP = U5, BMPU = threshold; \
                                                                                             if PCMP >= threshold, BMCMP = 0, BMPU = PCMP         */
/**
 * @}
 */

/**
 * @defgroup PID_Comp_Flag PID compete Flag
 * @{
 */
#define PID_COMP_FLAG_CPLT       (PID_CMP_CSTA_CMP_STA)  /*!< compete complete */
#define PID_COMP_FLAG_BURST_STA  (PID_CMP_CSTA_BSTA)     /*!< 1: burst < PID_BTH; 0: burst >= PID_BTH */
#define PID_COMP_FLAG_BURST_CPLT (PID_CMP_CSTA_BST_DONE) /*!< Burst complete */
#define PID_COMP_FLAG_RESULT     (PID_CMP_CSTA_UCSEL)    /*!< 2: PID2 data; 1: PID1 data */
#define PID_COMP_FLAG_ALL \
    (PID_COMP_FLAG_CPLT | PID_COMP_FLAG_BURST_STA | PID_COMP_FLAG_BURST_CPLT | PID_COMP_FLAG_RESULT)
#define PID_COMP_FLAG_CLR_ALL (PID_COMP_FLAG_CPLT | PID_COMP_FLAG_BURST_STA | PID_COMP_FLAG_BURST_CPLT) /*!< Clear all compete/burst flags */
    /**
     * @}
     */

    /**
     * @}
     */

