MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/inc/hc32_ll_pid.h
    /*******************************************************************************
     * Global variable definitions ('extern')
     ******************************************************************************/

    /*******************************************************************************
  Global function prototypes (definition in C source)
     ******************************************************************************/
    /**
     * @addtogroup PID_Global_Functions
     * @{
     */

    /**
     * @brief Write PID burst threshold.
     * @param [in] PID_CMPx        PID compete unit
     * @param [in] f32Data         Specifies the threshold
     * @retval None.
     */
    __STATIC_INLINE void PID_CMP_WriteBurstThreshold(CM_PID_CMP_TypeDef *PID_CMPx, float32_t f32Data)
    {
        WRITE_REG32(PID_CMPx->BTH, *(uint32_t *)(uint32_t)&f32Data);
    }

    /**
     * @brief Get PID burst result BMCMP.
     * @param [in] PID_CMPx        PID compete unit
     * @retval float32_t            The BMCMP value
     */
    __STATIC_INLINE float32_t PID_CMP_GetBurstBmcmp(CM_PID_CMP_TypeDef *PID_CMPx)
    {
        return *(__IO float32_t *)(uint32_t)&PID_CMPx->BMCMP;
    }

    /**
     * @brief Get PID burst result BMPU.
     * @param [in] PID_CMPx        PID compete unit
     * @retval float32_t            The BMPU value
     */
    __STATIC_INLINE float32_t PID_CMP_GetBurstBmpu(CM_PID_CMP_TypeDef *PID_CMPx)
    {
        return *(__IO float32_t *)(uint32_t)&PID_CMPx->BMPU;
    }

    /**
     * @brief Get PID competitive result.
     * @param [in] PID_CMPx        PID compete unit
     * @retval float32_t            The competitive result
     */
    __STATIC_INLINE float32_t PID_CMP_GetCompResult(CM_PID_CMP_TypeDef *PID_CMPx)
    {
        return *(__IO float32_t *)(uint32_t)&PID_CMPx->UC;
    }

    void PID_Cmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState);
    void PID_Start(CM_PID_TypeDef *PIDx);
    void PID_ClearData(CM_PID_TypeDef *PIDx);
    void PID_ResetFsm(CM_PID_TypeDef *PIDx);

    void PID_IntCmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState);
    void PID_SWStartCmd(CM_PID_TypeDef *PIDx, en_functional_state_t enNewState);

    int32_t PID_StructInit(stc_pid_init_t *pstcPidInit);
    int32_t PID_Init(CM_PID_TypeDef *PIDx, stc_pid_init_t *pstcPidInit);

    int32_t PID_SWStructInit(stc_pid_sw_init_t *pstcSWInit);
    int32_t PID_SWInit(CM_PID_TypeDef *PIDx, stc_pid_sw_init_t *pstcSWInit);

    int32_t PID_ConfigStructInit(stc_pid_config_t *pstcConfig);
    int32_t PID_Config(CM_PID_TypeDef *PIDx, stc_pid_config_t *pstcConfig);

    int32_t PID_GainStructInit(stc_pid_gain_config_t *pstcGainConfig);
    int32_t PID_GainConfig(CM_PID_TypeDef *PIDx, uint8_t u8CoefNum, stc_pid_gain_config_t *pstcGainConfig);

    int32_t PID_ReadActualGain(CM_PID_TypeDef *PIDx, stc_pid_gain_t *pstcGain);

    int32_t PID_GainSwitchStructInit(stc_pid_gain_switch_t *pstcGainSwitch);
    int32_t PID_GainSwitchConfig(CM_PID_TypeDef *PIDx, stc_pid_gain_switch_t *pstcGainSwitch);

    int32_t PID_ValueStructInit(stc_pid_value_config_t *pstValueConfig);
    int32_t PID_ValueConfig(CM_PID_TypeDef *PIDx, stc_pid_value_config_t *pstValueConfig);
    int32_t PID_ReadValue(CM_PID_TypeDef *PIDx, stc_pid_value_t *pstcValue);

    void PID_SetExpectedValue(CM_PID_TypeDef *PIDx, float32_t f32Ev);
    void PID_SetActualValue(CM_PID_TypeDef *PIDx, float32_t f32Av);

    float32_t PID_GetUValue(CM_PID_TypeDef *PIDx);
    float32_t PID_GetFinalValue(CM_PID_TypeDef *PIDx);
    float32_t PID_GetU5Value(CM_PID_TypeDef *PIDx);

    int32_t PID_UxPxStructInit(stc_pid_uxpx_t *pstcUxPx);
    int32_t PID_UxPxConfig(CM_PID_TypeDef *PIDx, stc_pid_uxpx_t *pstcUxPx);
    int32_t PID_ReadUxPx(CM_PID_TypeDef *PIDx, stc_pid_uxpx_t *pstcUxPx);

    en_flag_status_t PID_GetStatus(CM_PID_TypeDef *PIDx, uint32_t u32Flag);
    void PID_ClearStatus(CM_PID_TypeDef *PIDx, uint32_t u32Flag);

    int32_t PID_CMP_StructInit(stc_pid_cmp_init_t *pstcCmpInit);
    int32_t PID_CMP_Init(CM_PID_CMP_TypeDef *PID_CMP, stc_pid_cmp_init_t *pstcCmpInit);

    uint32_t PID_CMP_GetStatus(CM_PID_CMP_TypeDef *PID_CMPx, uint32_t u32Flag);
    void PID_CMP_ClearStatus(CM_PID_CMP_TypeDef *PID_CMPx, uint32_t u32Flag);

    /**
     * @}
     */

#endif /* LL_PID_ENABLE */

    /**
     * @}
     */

    /**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* __HC32_LL_PID_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
